#+TITLE: On-demand Selenium on OpenShift
#+AUTHOR: James Blair
#+DATE: <2024-03-14 Tue 09:00>

* Step 1 - Install OpenShift Pipelines

Before we get into setting up Selenium testing pipelines we first need to install the [[https://docs.openshift.com/container-platform/4.10/cicd/pipelines/understanding-openshift-pipelines.html][OpenShift Pipelines]] operator so we can easily create and interact with pipelines on the cluster.

Our first step is to create a ~subscription~ resource which will automatically install the OpenShift Pipelines operator. Let's run the code block below to do that.

#+begin_src bash :results output
cat << EOF | oc apply --filename -
apiVersion: operators.coreos.com/v1alpha1
kind: Subscription
metadata:
  name: openshift-pipelines-operator
  namespace: openshift-operators
spec:
  channel: latest
  name: openshift-pipelines-operator-rh
  source: redhat-operators
  sourceNamespace: openshift-marketplace
EOF
#+end_src

#+RESULTS:
: subscription.operators.coreos.com/openshift-pipelines-operator created


* Step 2 - Create sample selenium pipeline

Once OpenShift Pipelines is installed we can create an example pipeline to demonstrate the flow in the diagram above.



#+begin_src bash :results output
# Create namespace for application test environment
oc new-project parksmap-tst

# Create pipeline
cat << EOF | oc apply --filename -


EOF
#+end_src

#+RESULTS:
#+begin_example
Now using project "parksmap-tst" on server "https://api.cluster-272j9.dynamic.redhatworkshops.io:6443".

You can add applications to this project with the 'new-app' command. For example, try:

    oc new-app rails-postgresql-example

to build a new example application in Ruby. Or use kubectl to deploy a simple Kubernetes application:

    kubectl create deployment hello-node --image=k8s.gcr.io/e2e-test-images/agnhost:2.33 -- /agnhost serve-hostname

#+end_example
